bright_emojis = '''🟥🟧🟨🟩🟦🟪🟫⬛⬜🔴🟠🟡🟢🔵🟣🟤⚫⚪🔶🔷♦️♥️♠️♣️🔺🔻🔸🔹
🔳🔲✅❌⚡🔥🟥🟧🟨🟩🟦🟪🟧🟨🟩🟦🟪🟥🟨🟩🟦🟪🟥🟧🟩🟦🟪🟥🟧🟨✅❌⚡🔥🎯🎨⭐🎭🎪🎢🎠🎉
🔶🔷♦️♥️♠️♣️🔺🔻🔸🔹🔳🔲⭐🎆🎇✨🎉🎊'''
basic_people = "👤👥🫂👦👧🧒👨👩🧑👩‍🦱👨‍🦱👩‍🦰👨‍🦰👱‍♀️👱‍♂️👴👵🧓"
professions = "👨‍⚕️👩‍⚕️👨‍🎓👩‍🎓👨‍🏫👩‍🏫👨‍⚖️👩‍⚖️👨‍🌾👩‍🌾👨‍🍳👩‍🍳👨‍🔧👩‍🔧👨‍🏭👩‍🏭👨‍💼👩‍💼👨‍🔬👩‍🔬👨‍💻👩‍💻👨‍🎤👩‍🎤👨‍🎨👩‍🎨👨‍✈️👩‍✈️👨‍🚀👩‍🚀👨‍🚒👩‍🚒"
actions = "🚶🏃💃🕺👯‍♂️👯‍♀️🧖‍♀️🧖‍♂️🧗‍♀️🧗‍♂️🏇🏌️‍♀️🏌️‍♂️🏄‍♀️🏄‍♂️🚣‍♀️🚣‍♂️🏊‍♀️🏊‍♂️⛹️‍♀️⛹️‍♂️🏋️‍♀️🏋️‍♂️🚴‍♀️🚴‍♂️🚵‍♀️🚵‍♂️🤸‍♀️🤸‍♂️🤽‍♀️🤽‍♂️🤾‍♀️🤾‍♂️🤹‍♀️🤹‍♂️"
gestures = "🙇‍♀️🙇‍♂️🤦‍♀️🤦‍♂️🤷‍♀️🤷‍♂️🙅‍♀️🙅‍♂️🙆‍♀️🙆‍♂️💁‍♀️💁‍♂️🙋‍♀️🙋‍♂️🧏‍♀️🧏‍♂️🤝🤲👐🙌👏🤝👍👎👊✊🤛🤜🤞✌️🤟🤘👌🤌🤏👈👉👆👇☝️✋🤚🖐️🖖👋🤙💪🦵🦶👂👃🧠🦷🦴👀👁️👅👄"
family = "👪👨‍👩‍👦👨‍👩‍👧👨‍👩‍👧‍👦👨‍👩‍👦‍👦👨‍👩‍👧‍👧👨‍👨‍👦👨‍👨‍👧👨‍👨‍👧‍👦👨‍👨‍👦‍👦👨‍👨‍👧‍👧👩‍👩‍👦👩‍👩‍👧👩‍👩‍👧‍👦👩‍👩‍👦‍👦👩‍👩‍👧‍👧👨‍👦👨‍👦‍👦👨‍👧👨‍👧‍👦👨‍👧‍👧👩‍👦👩‍👦‍👦👩‍👧👩‍👧‍👦👩‍👧‍👧💑👨‍❤️‍👨👩‍❤️‍👩💏👨‍❤️‍💋‍👨👩‍❤️‍💋‍👩"

import time
import os

tick = 1
while True:
    #os.system('cls')
    print('\033[2J\033[H', end="")
    print(f"Кадр: {tick}")

    # Фиксированный размер, который влезет в большинство терминалов
    for i in range(20):  # 20 строк
        for j in range(100):  # 40 эмодзи в строке (займет ~80 символов)
            print('\033[31m█', end='')
        print()

    tick += 1
    #time.sleep(.014)
